[
    {
        "id": "win32-application-reverse-engineering-and-patching",
        "title": "Win32 application reverse engineering and patching",
        "subtitle": "I dug deeply inside some closed-source binary applications. Here I'd like to collect what I consider worth sharing",
        "body": null,
        "extra": "projects/win32_reverse_engineering.mustache",
        "image": "win32_reverse_engineering.png",
        "draft": false
    },
    {
        "id": "kalman-filter-for-gps-and-obdii-data-fusion",
        "title": "Kalman filter for GPS and OBD-II data fusion",
        "subtitle": "TODO",
        "body": null,
        "extra": null,
        "image": "kalman-car-simulator.png",
        "draft": true
    },
    {
        "id": "iot-environmental-sensor",
        "title": "IoT environmental sensor",
        "subtitle": "Based on the ESP8266",
        "body": null,
        "extra": null,
        "image": null,
        "draft": true
    },
    {
        "id": "elimina-code-integrato-in-wingesfar",
        "title": "Queue management system",
        "subtitle": "Works with Wingesfar and it is build using microservices architecture: Docker containers and native applications. Communication is based on MQTT",
        "body": null,
        "extra": null,
        "image": null,
        "draft": true
    },
    {
        "id": "5g-coral",
        "title": "5G-CORAL",
        "subtitle": "TODO",
        "body": null,
        "extra": null,
        "image": "5g-coral.jpg",
        "draft": false
    },
    {
        "id": "bespecular",
        "title": "BeSpecular",
        "subtitle": "BeSpecular is an app that lets you help blind & deafblind people identify objects or situations.<br>More info at <a href=\"https://www.bespecular.com\">www.bespecular.com</a>",
        "body": null,
        "extra": "projects/bespecular.mustache",
        "image": "bespecular_stanford_team.jpg",
        "draft": false
    },
    {
        "id": "smart-anchor",
        "title": "Smart Anchor",
        "subtitle": "",
        "body": "SmartAnchor is a device that tells you if a boat anchor is dragging or not by detecting its vibrations. This provides the skipper with one more tool that allows him to stay more relaxed if spending the night at anchor. I've done several tests with a device attached on an anchor and linked to the boat via a cable. The first figure shows an example of a measurement. I first devised a system that allows to correctly process the data and trigger an alarm in case of a detection of some vibrations. It computes the RMS value of acceleration over the three axes, then a derivative is computed to detect sudden changes of gravity. This is followed by a low pass filtering and a Schmitt trigger. I'm currently working on the communication between the device and the boat and ultrasonic waves seem like to only option. I built a fully software DBPSK modulator running on the device attached to the anchor. The demodulation is again fully software and uses a Costas loop to reconstruct the carrier frequency (non coherent demodulation). So far it has only been implemented in MATLAB, but using real data that has been transmitted over ultrasonic waves from one side of the room to the other. The last figure shows the demodulation process.",
        "extra": null,
        "image": "smart_anchor_transmitter.jpg",
        "draft": true
    },
    {
        "id": "cross-coupled-oscillator",
        "title": "Cross coupled oscillator",
        "subtitle": "",
        "body": "This circuit is an oscillator and it generates a sinusoidal waveform. Oscillators are circuits that always fascinated me: they can generate a signal on their own, starting from a DC power supply. This particular circuit is based on the classic LC resonant tank. The LC circuit will naturally oscillate at its resonant frequency, but the oscillations will be dumped primarily because of the parasitic resistance of the coil. The idea behind this circuit is to place in parallel with the LC circuit a negative resistance that, in parallel with the parasitic one, will cancel the latter one out, resulting in an equivalent \"infinite\" impedance. Of course, things are much more complicated. I conducted a deep study on this circuit, in particular I used the shooting method (implemented by myself in MATLAB) to accurately compute the oscillation period. The study can be found here (Italian).",
        "extra": null,
        "image": "cross_coupled.jpg",
        "draft": false
    },
    {
        "id": "expomash-expo-milano-2015",
        "title": "Expomash for EXPO Milano 2015",
        "subtitle": "A website that uses the Elo's Algorithm to rank the pavillions at EXPO Milano 2015",
        "body": null,
        "extra": null,
        "image": "expomash.png",
        "draft": false
    },
    {
        "id": "msc-thesis",
        "title": "M.Sc. Thesis",
        "subtitle": "",
        "body": null,
        "extra": "projects/thesis.mustache",
        "image": "thesis-readout.jpg",
        "draft": true
    },
    {
        "id": "joule-thief",
        "title": "Joule Thief",
        "subtitle": "",
        "body": "A Joule Thief is a circuit used to elevate a small DC voltage to a much higher AC voltage. Compared to the classic circuit, the one I built has been modified in order to power a small neon lamp instead of a LED. The neon lamp requires about 160V to ionize the gas it contains and therefore to produce light. Since this voltage cannot be present across the Collector and the Emitter pins of the BJT without burning it, I had to make a little modification to the transformer, adding to it an additional winding connected directly to the neon lamp. This way the voltage will rise both across the neon lamp and the C and E of the transistor, but at two different rates, according to the respective number of loops of the two windings. The voltage across the neon lamp will reach the required 160V before the VCE reaches the breakdown voltage. This circuit fascinates me because it is a boost DC DC converter that also oscillates by itself, exploiting the nonlinearity of the magnetic core",
        "extra": null,
        "image": "joule_thief.jpg",
        "draft": true
    },
    {
        "id": "class-a-amplifier",
        "title": "Class A amplifier",
        "subtitle": "",
        "body": "During my Bachelor's degree my friend Giacomo Petracca and I decided to build some of the circuits we studied in class. The first one we build was a (bulky) class A amplifier, and it has been the first non trivial circuit I have ever designed and not just built or modified. Hearing the music coming out of the loudspeaker connected to it was a big satisfaction!",
        "extra": null,
        "image": "classA-amplifier.jpg",
        "draft": true
    },
    {
        "id": "one-of-my-first-circuits",
        "title": "One of my first circuits",
        "subtitle": "This is one of my favorite pictures of when I was a kid. Here I'm demonstrating series vs parallel connections.",
        "body": "This is one of my favorite pictures of when I was a kid. That is me showing my mother a simple circuit I built. I guess that was to show the difference between two lamps connected in series or parallel. In fact, the two at the back of the picture are connected in series and are less bright than the closest one, which is connected in parallel to the other two.",
        "extra": null,
        "image": "me-4-years-old-thumb.jpg",
        "draft": false
    }
]
